Revit 2027 API
VertexIndexPairArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual VertexIndexPairArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As VertexIndexPairArrayIterator
public:
virtual VertexIndexPairArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> VertexIndexPairArrayIterator
override ForwardIterator : unit -> VertexIndexPairArrayIterator
Return Value
VertexIndexPairArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace